SensorLogicInc/modules/slmx4_projects/lux_demo/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x01U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0xA0000000U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_B1_15 (coord B14), USER_BUTTON2 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_BUTTON2_PERIPHERAL                             GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_USER_BUTTON2_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_BUTTON2_CHANNEL                                  31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_BUTTON2_GPIO                                   GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_BUTTON2_GPIO_PIN                                 31U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_BUTTON2_GPIO_PIN_MASK                    (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_USER_BUTTON2_PORT                                   GPIO7   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_USER_BUTTON2_PIN                                      31U   /*!< PORT pin number */
#define BOARD_INITPINS_USER_BUTTON2_PIN_MASK                         (1U << 31U)   /*!< PORT pin mask */

/* GPIO_AD_B0_00 (coord M14), USER_BUTTON1 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_BUTTON1_PERIPHERAL                             GPIO6   /*!< Peripheral name */
#define BOARD_INITPINS_USER_BUTTON1_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_BUTTON1_CHANNEL                                   0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_BUTTON1_GPIO                                   GPIO6   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_BUTTON1_GPIO_PIN                                  0U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_BUTTON1_GPIO_PIN_MASK                     (1U << 0U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_USER_BUTTON1_PORT                                   GPIO6   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_USER_BUTTON1_PIN                                       0U   /*!< PORT pin number */
#define BOARD_INITPINS_USER_BUTTON1_PIN_MASK                          (1U << 0U)   /*!< PORT pin mask */

/* GPIO_B1_13 (coord D14), WDOG */
/* Routed pin properties */
#define BOARD_INITPINS_WDOG_PERIPHERAL                                     GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_WDOG_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_INITPINS_WDOG_CHANNEL                                          29U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_WDOG_GPIO                                           GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_WDOG_GPIO_PIN                                         29U   /*!< GPIO pin number */
#define BOARD_INITPINS_WDOG_GPIO_PIN_MASK                            (1U << 29U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_WDOG_PORT                                           GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_WDOG_PIN                                              29U   /*!< PORT pin number */
#define BOARD_INITPINS_WDOG_PIN_MASK                                 (1U << 29U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_EMC_10 (coord G1), ADDR01 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR01_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR01_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR01_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_11 (coord G3), ADDR02 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR02_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR02_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR02_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_12 (coord H1), ADDR03 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR03_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR03_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR03_CHANNEL                                       3U   /*!< Signal channel */

/* GPIO_EMC_13 (coord A6), ADDR04 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR04_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR04_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR04_CHANNEL                                       4U   /*!< Signal channel */

/* GPIO_EMC_14 (coord B6), ADDR05 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR05_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR05_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR05_CHANNEL                                       5U   /*!< Signal channel */

/* GPIO_EMC_15 (coord B1), ADDR06 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR06_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR06_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR06_CHANNEL                                       6U   /*!< Signal channel */

/* GPIO_EMC_16 (coord A5), ADDR07 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR07_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR07_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR07_CHANNEL                                       7U   /*!< Signal channel */

/* GPIO_EMC_17 (coord A4), ADDR08 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR08_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR08_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR08_CHANNEL                                       8U   /*!< Signal channel */

/* GPIO_EMC_18 (coord B2), ADDR09 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR09_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR09_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR09_CHANNEL                                       9U   /*!< Signal channel */

/* GPIO_EMC_23 (coord G2), ADDR10 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR10_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR10_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR10_CHANNEL                                      10U   /*!< Signal channel */

