SensorLogicInc/modules/slmx4_projects/lux_demo/board/pin_mux.h
/* GPIO_EMC_19 (coord B4), ADDR11 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR11_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR11_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR11_CHANNEL                                      11U   /*!< Signal channel */

/* GPIO_EMC_21 (coord C1), BA0 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_BA0_PERIPHERAL                                     SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_BA0_SIGNAL                                           BA   /*!< Signal name */
#define BOARD_INIT_SDRAM_BA0_CHANNEL                                          0U   /*!< Signal channel */

/* GPIO_EMC_22 (coord F1), BA1 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_BA1_PERIPHERAL                                     SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_BA1_SIGNAL                                           BA   /*!< Signal name */
#define BOARD_INIT_SDRAM_BA1_CHANNEL                                          1U   /*!< Signal channel */

/* GPIO_EMC_24 (coord D3), CAS */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_CAS_PERIPHERAL                                     SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_CAS_SIGNAL                                     semc_cas   /*!< Signal name */

/* GPIO_EMC_27 (coord A2), CKE */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_CKE_PERIPHERAL                                     SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_CKE_SIGNAL                                     semc_cke   /*!< Signal name */

/* GPIO_EMC_26 (coord B3), CLK */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_CLK_PERIPHERAL                                     SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_CLK_SIGNAL                                     semc_clk   /*!< Signal name */

/* GPIO_EMC_25 (coord D2), RAS */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_RAS_PERIPHERAL                                     SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_RAS_SIGNAL                                     semc_ras   /*!< Signal name */

/* GPIO_EMC_28 (coord D1), WE */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_WE_PERIPHERAL                                      SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_WE_SIGNAL                                       semc_we   /*!< Signal name */

/* GPIO_EMC_29 (coord E1), CS */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_CS_PERIPHERAL                                      SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_CS_SIGNAL                                            CS   /*!< Signal name */
#define BOARD_INIT_SDRAM_CS_CHANNEL                                           0U   /*!< Signal channel */

/* GPIO_EMC_37 (coord E4), DATA15 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA15_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA15_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA15_CHANNEL                                      15U   /*!< Signal channel */

/* GPIO_EMC_36 (coord C3), DATA14 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA14_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA14_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA14_CHANNEL                                      14U   /*!< Signal channel */

/* GPIO_EMC_35 (coord E5), DATA13 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA13_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA13_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA13_CHANNEL                                      13U   /*!< Signal channel */

/* GPIO_EMC_34 (coord D4), DATA12 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA12_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA12_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA12_CHANNEL                                      12U   /*!< Signal channel */

/* GPIO_EMC_00 (coord E3), DATA00 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA00_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA00_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA00_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_01 (coord F3), DATA01 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA01_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA01_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA01_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_03 (coord G4), DATA03 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA03_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA03_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA03_CHANNEL                                       3U   /*!< Signal channel */

/* GPIO_EMC_02 (coord F4), DATA02 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA02_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA02_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA02_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_04 (coord F2), DATA04 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA04_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA04_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA04_CHANNEL                                       4U   /*!< Signal channel */

/* GPIO_EMC_05 (coord G5), DATA05 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA05_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA05_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA05_CHANNEL                                       5U   /*!< Signal channel */

