SensorLogicInc/modules/slmx4_projects/lux_demo/board/pin_mux.h
/* GPIO_EMC_06 (coord H5), DATA06 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA06_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA06_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA06_CHANNEL                                       6U   /*!< Signal channel */

/* GPIO_EMC_07 (coord H4), DATA07 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA07_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA07_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA07_CHANNEL                                       7U   /*!< Signal channel */

/* GPIO_EMC_30 (coord C6), DATA08 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA08_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA08_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA08_CHANNEL                                       8U   /*!< Signal channel */

/* GPIO_EMC_31 (coord C5), DATA09 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA09_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA09_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA09_CHANNEL                                       9U   /*!< Signal channel */

/* GPIO_EMC_32 (coord D5), DATA10 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA10_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA10_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA10_CHANNEL                                      10U   /*!< Signal channel */

/* GPIO_EMC_33 (coord C4), DATA11 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DATA11_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DATA11_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INIT_SDRAM_DATA11_CHANNEL                                      11U   /*!< Signal channel */

/* GPIO_EMC_08 (coord H3), DM0 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DM0_PERIPHERAL                                     SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DM0_SIGNAL                                           DM   /*!< Signal name */
#define BOARD_INIT_SDRAM_DM0_CHANNEL                                          0U   /*!< Signal channel */

/* GPIO_EMC_38 (coord D6), DM1 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DM1_PERIPHERAL                                     SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DM1_SIGNAL                                           DM   /*!< Signal name */
#define BOARD_INIT_SDRAM_DM1_CHANNEL                                          1U   /*!< Signal channel */

/* GPIO_EMC_09 (coord C2), ADDR00 */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_ADDR00_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_ADDR00_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INIT_SDRAM_ADDR00_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_39 (coord B7), DQS */
/* Routed pin properties */
#define BOARD_INIT_SDRAM_DQS_PERIPHERAL                                     SEMC   /*!< Peripheral name */
#define BOARD_INIT_SDRAM_DQS_SIGNAL                                     semc_dqs   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_SDRAM(void);

/* GPIO_SD_B1_08 (coord P3), IO0 */
/* Routed pin properties */
#define BOARD_INIT_FLASH_IO0_PERIPHERAL                                  FLEXSPI   /*!< Peripheral name */
#define BOARD_INIT_FLASH_IO0_SIGNAL                              FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B1_09 (coord N4), IO1 */
/* Routed pin properties */
#define BOARD_INIT_FLASH_IO1_PERIPHERAL                                  FLEXSPI   /*!< Peripheral name */
#define BOARD_INIT_FLASH_IO1_SIGNAL                              FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B1_10 (coord P4), IO2 */
/* Routed pin properties */
#define BOARD_INIT_FLASH_IO2_PERIPHERAL                                  FLEXSPI   /*!< Peripheral name */
#define BOARD_INIT_FLASH_IO2_SIGNAL                              FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B1_11 (coord P5), IO3 */
/* Routed pin properties */
#define BOARD_INIT_FLASH_IO3_PERIPHERAL                                  FLEXSPI   /*!< Peripheral name */
#define BOARD_INIT_FLASH_IO3_SIGNAL                              FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_SD_B1_05 (coord N3), DQS */
/* Routed pin properties */
#define BOARD_INIT_FLASH_DQS_PERIPHERAL                                  FLEXSPI   /*!< Peripheral name */
#define BOARD_INIT_FLASH_DQS_SIGNAL                                FLEXSPI_A_DQS   /*!< Signal name */

/* GPIO_SD_B1_07 (coord L4), CLK */
/* Routed pin properties */
#define BOARD_INIT_FLASH_CLK_PERIPHERAL                                  FLEXSPI   /*!< Peripheral name */
#define BOARD_INIT_FLASH_CLK_SIGNAL                               FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_SD_B1_06 (coord L3), CS */
/* Routed pin properties */
#define BOARD_INIT_FLASH_CS_PERIPHERAL                                   FLEXSPI   /*!< Peripheral name */
#define BOARD_INIT_FLASH_CS_SIGNAL                               FLEXSPI_A_SS0_B   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_Flash(void);

#define BOARD_INIT_SD_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x04000000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_INIT_SD_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x10000000U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

