SensorLogicInc/modules/slmx4_projects/lux_demo/board/pin_mux.h
/* GPIO_SD_B0_04 (coord H2), DAT2 */
/* Routed pin properties */
#define BOARD_INIT_SD_DAT2_PERIPHERAL                                     USDHC1   /*!< Peripheral name */
#define BOARD_INIT_SD_DAT2_SIGNAL                                     usdhc_data   /*!< Signal name */
#define BOARD_INIT_SD_DAT2_CHANNEL                                            2U   /*!< Signal channel */

/* GPIO_SD_B0_05 (coord J2), DAT3 */
/* Routed pin properties */
#define BOARD_INIT_SD_DAT3_PERIPHERAL                                     USDHC1   /*!< Peripheral name */
#define BOARD_INIT_SD_DAT3_SIGNAL                                     usdhc_data   /*!< Signal name */
#define BOARD_INIT_SD_DAT3_CHANNEL                                            3U   /*!< Signal channel */

/* GPIO_SD_B0_03 (coord K1), DAT1 */
/* Routed pin properties */
#define BOARD_INIT_SD_DAT1_PERIPHERAL                                     USDHC1   /*!< Peripheral name */
#define BOARD_INIT_SD_DAT1_SIGNAL                                     usdhc_data   /*!< Signal name */
#define BOARD_INIT_SD_DAT1_CHANNEL                                            1U   /*!< Signal channel */

/* GPIO_SD_B0_02 (coord J1), DAT0 */
/* Routed pin properties */
#define BOARD_INIT_SD_DAT0_PERIPHERAL                                     USDHC1   /*!< Peripheral name */
#define BOARD_INIT_SD_DAT0_SIGNAL                                     usdhc_data   /*!< Signal name */
#define BOARD_INIT_SD_DAT0_CHANNEL                                            0U   /*!< Signal channel */

/* GPIO_SD_B0_01 (coord J3), CLK */
/* Routed pin properties */
#define BOARD_INIT_SD_CLK_PERIPHERAL                                      USDHC1   /*!< Peripheral name */
#define BOARD_INIT_SD_CLK_SIGNAL                                       usdhc_clk   /*!< Signal name */

/* GPIO_SD_B0_00 (coord J4), CMD */
/* Routed pin properties */
#define BOARD_INIT_SD_CMD_PERIPHERAL                                      USDHC1   /*!< Peripheral name */
#define BOARD_INIT_SD_CMD_SIGNAL                                       usdhc_cmd   /*!< Signal name */

/* GPIO_B1_12 (coord D13), CD */
/* Routed pin properties */
#define BOARD_INIT_SD_CD_PERIPHERAL                                        GPIO2   /*!< Peripheral name */
#define BOARD_INIT_SD_CD_SIGNAL                                          gpio_io   /*!< Signal name */
#define BOARD_INIT_SD_CD_CHANNEL                                             28U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_SD_CD_GPIO                                              GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_SD_CD_GPIO_PIN                                            28U   /*!< GPIO pin number */
#define BOARD_INIT_SD_CD_GPIO_PIN_MASK                               (1U << 28U)   /*!< GPIO pin mask */
#define BOARD_INIT_SD_CD_PORT                                              GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_SD_CD_PIN                                                 28U   /*!< PORT pin number */
#define BOARD_INIT_SD_CD_PIN_MASK                                    (1U << 28U)   /*!< PORT pin mask */

/* GPIO_AD_B1_10 (coord L13), SD_PWR_EN */
/* Routed pin properties */
#define BOARD_INIT_SD_SD_PWR_EN_PERIPHERAL                                 GPIO1   /*!< Peripheral name */
#define BOARD_INIT_SD_SD_PWR_EN_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INIT_SD_SD_PWR_EN_CHANNEL                                      26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_SD_SD_PWR_EN_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_SD_SD_PWR_EN_GPIO_PIN                                     26U   /*!< GPIO pin number */
#define BOARD_INIT_SD_SD_PWR_EN_GPIO_PIN_MASK                        (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INIT_SD_SD_PWR_EN_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INIT_SD_SD_PWR_EN_PIN                                          26U   /*!< PORT pin number */
#define BOARD_INIT_SD_SD_PWR_EN_PIN_MASK                             (1U << 26U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_SD(void);

#define BOARD_INIT_WICED_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x80000000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_INIT_WICED_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x4E800000U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_AD_B0_14 (coord H14), BT_UART_CTS */
/* Routed pin properties */
#define BOARD_INIT_WICED_BT_UART_CTS_PERIPHERAL                          LPUART1   /*!< Peripheral name */
#define BOARD_INIT_WICED_BT_UART_CTS_SIGNAL                                CTS_B   /*!< Signal name */

/* GPIO_AD_B0_15 (coord L10), BT_UART_RTS */
/* Routed pin properties */
#define BOARD_INIT_WICED_BT_UART_RTS_PERIPHERAL                          LPUART1   /*!< Peripheral name */
#define BOARD_INIT_WICED_BT_UART_RTS_SIGNAL                                RTS_B   /*!< Signal name */

/* GPIO_AD_B0_13 (coord L14), BT_UART_TXD */
/* Routed pin properties */
#define BOARD_INIT_WICED_BT_UART_TXD_PERIPHERAL                          LPUART1   /*!< Peripheral name */
#define BOARD_INIT_WICED_BT_UART_TXD_SIGNAL                                   RX   /*!< Signal name */

/* GPIO_AD_B0_12 (coord K14), BT_UART_RXD */
/* Routed pin properties */
#define BOARD_INIT_WICED_BT_UART_RXD_PERIPHERAL                          LPUART1   /*!< Peripheral name */
#define BOARD_INIT_WICED_BT_UART_RXD_SIGNAL                                   TX   /*!< Signal name */

/* GPIO_B1_09 (coord A13), WL_REG_ON */
/* Routed pin properties */
#define BOARD_INIT_WICED_WL_REG_ON_PERIPHERAL                              GPIO2   /*!< Peripheral name */
#define BOARD_INIT_WICED_WL_REG_ON_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INIT_WICED_WL_REG_ON_CHANNEL                                   25U   /*!< Signal channel */

