SensorLogicInc/modules/slmx4_projects/lux_demo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INIT_WICED_WL_REG_ON_GPIO                                    GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_WICED_WL_REG_ON_GPIO_PIN                                  25U   /*!< GPIO pin number */
#define BOARD_INIT_WICED_WL_REG_ON_GPIO_PIN_MASK                     (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_INIT_WICED_WL_REG_ON_PORT                                    GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_WICED_WL_REG_ON_PIN                                       25U   /*!< PORT pin number */
#define BOARD_INIT_WICED_WL_REG_ON_PIN_MASK                          (1U << 25U)   /*!< PORT pin mask */

/* GPIO_B1_10 (coord B13), BT_REG_ON */
/* Routed pin properties */
#define BOARD_INIT_WICED_BT_REG_ON_PERIPHERAL                              GPIO2   /*!< Peripheral name */
#define BOARD_INIT_WICED_BT_REG_ON_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INIT_WICED_BT_REG_ON_CHANNEL                                   26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_WICED_BT_REG_ON_GPIO                                    GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_WICED_BT_REG_ON_GPIO_PIN                                  26U   /*!< GPIO pin number */
#define BOARD_INIT_WICED_BT_REG_ON_GPIO_PIN_MASK                     (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INIT_WICED_BT_REG_ON_PORT                                    GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_WICED_BT_REG_ON_PIN                                       26U   /*!< PORT pin number */
#define BOARD_INIT_WICED_BT_REG_ON_PIN_MASK                          (1U << 26U)   /*!< PORT pin mask */

/* GPIO_B1_07 (coord B12), BT_HOSTWAKE */
/* Routed pin properties */
#define BOARD_INIT_WICED_BT_HOSTWAKE_PERIPHERAL                            GPIO2   /*!< Peripheral name */
#define BOARD_INIT_WICED_BT_HOSTWAKE_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INIT_WICED_BT_HOSTWAKE_CHANNEL                                 23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_WICED_BT_HOSTWAKE_GPIO                                  GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_WICED_BT_HOSTWAKE_GPIO_PIN                                23U   /*!< GPIO pin number */
#define BOARD_INIT_WICED_BT_HOSTWAKE_GPIO_PIN_MASK                   (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_INIT_WICED_BT_HOSTWAKE_PORT                                  GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_WICED_BT_HOSTWAKE_PIN                                     23U   /*!< PORT pin number */
#define BOARD_INIT_WICED_BT_HOSTWAKE_PIN_MASK                        (1U << 23U)   /*!< PORT pin mask */

/* GPIO_B1_11 (coord C13), WIFI_GPIO2 */
/* Routed pin properties */
#define BOARD_INIT_WICED_WIFI_GPIO2_PERIPHERAL                             GPIO2   /*!< Peripheral name */
#define BOARD_INIT_WICED_WIFI_GPIO2_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INIT_WICED_WIFI_GPIO2_CHANNEL                                  27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_WICED_WIFI_GPIO2_GPIO                                   GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_WICED_WIFI_GPIO2_GPIO_PIN                                 27U   /*!< GPIO pin number */
#define BOARD_INIT_WICED_WIFI_GPIO2_GPIO_PIN_MASK                    (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INIT_WICED_WIFI_GPIO2_PORT                                   GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_WICED_WIFI_GPIO2_PIN                                      27U   /*!< PORT pin number */
#define BOARD_INIT_WICED_WIFI_GPIO2_PIN_MASK                         (1U << 27U)   /*!< PORT pin mask */

/* GPIO_B1_14 (coord C14), WIFI_GPIO3 */
/* Routed pin properties */
#define BOARD_INIT_WICED_WIFI_GPIO3_PERIPHERAL                             GPIO2   /*!< Peripheral name */
#define BOARD_INIT_WICED_WIFI_GPIO3_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INIT_WICED_WIFI_GPIO3_CHANNEL                                  30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_WICED_WIFI_GPIO3_GPIO                                   GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_WICED_WIFI_GPIO3_GPIO_PIN                                 30U   /*!< GPIO pin number */
#define BOARD_INIT_WICED_WIFI_GPIO3_GPIO_PIN_MASK                    (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INIT_WICED_WIFI_GPIO3_PORT                                   GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_WICED_WIFI_GPIO3_PIN                                      30U   /*!< PORT pin number */
#define BOARD_INIT_WICED_WIFI_GPIO3_PIN_MASK                         (1U << 30U)   /*!< PORT pin mask */

/* GPIO_AD_B1_15 (coord J14), BT_WAKE */
/* Routed pin properties */
#define BOARD_INIT_WICED_BT_WAKE_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INIT_WICED_BT_WAKE_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INIT_WICED_BT_WAKE_CHANNEL                                     31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_WICED_BT_WAKE_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_WICED_BT_WAKE_GPIO_PIN                                    31U   /*!< GPIO pin number */
#define BOARD_INIT_WICED_BT_WAKE_GPIO_PIN_MASK                       (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INIT_WICED_BT_WAKE_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INIT_WICED_BT_WAKE_PIN                                         31U   /*!< PORT pin number */
#define BOARD_INIT_WICED_BT_WAKE_PIN_MASK                            (1U << 31U)   /*!< PORT pin mask */

/* GPIO_AD_B1_09 (coord M13), WIFI_SDIO_CLK */
/* Routed pin properties */
#define BOARD_INIT_WICED_WIFI_SDIO_CLK_PERIPHERAL                         USDHC2   /*!< Peripheral name */
#define BOARD_INIT_WICED_WIFI_SDIO_CLK_SIGNAL                          usdhc_clk   /*!< Signal name */

/* GPIO_AD_B1_08 (coord H13), WIFI_SDIO_CMD */
/* Routed pin properties */
#define BOARD_INIT_WICED_WIFI_SDIO_CMD_PERIPHERAL                         USDHC2   /*!< Peripheral name */
#define BOARD_INIT_WICED_WIFI_SDIO_CMD_SIGNAL                          usdhc_cmd   /*!< Signal name */

/* GPIO_AD_B1_04 (coord L12), WIDI_SDIO_D0 */
/* Routed pin properties */
#define BOARD_INIT_WICED_WIDI_SDIO_D0_PERIPHERAL                          USDHC2   /*!< Peripheral name */
#define BOARD_INIT_WICED_WIDI_SDIO_D0_SIGNAL                          usdhc_data   /*!< Signal name */
#define BOARD_INIT_WICED_WIDI_SDIO_D0_CHANNEL                                 0U   /*!< Signal channel */

/* GPIO_AD_B1_05 (coord K12), WIDI_SDIO_D1 */
/* Routed pin properties */
#define BOARD_INIT_WICED_WIDI_SDIO_D1_PERIPHERAL                          USDHC2   /*!< Peripheral name */
#define BOARD_INIT_WICED_WIDI_SDIO_D1_SIGNAL                          usdhc_data   /*!< Signal name */
#define BOARD_INIT_WICED_WIDI_SDIO_D1_CHANNEL                                 1U   /*!< Signal channel */

/* GPIO_AD_B1_06 (coord J12), WIDI_SDIO_D2 */
/* Routed pin properties */
#define BOARD_INIT_WICED_WIDI_SDIO_D2_PERIPHERAL                          USDHC2   /*!< Peripheral name */
#define BOARD_INIT_WICED_WIDI_SDIO_D2_SIGNAL                          usdhc_data   /*!< Signal name */
#define BOARD_INIT_WICED_WIDI_SDIO_D2_CHANNEL                                 2U   /*!< Signal channel */

/* GPIO_AD_B1_07 (coord K10), WIDI_SDIO_D3 */
/* Routed pin properties */
#define BOARD_INIT_WICED_WIDI_SDIO_D3_PERIPHERAL                          USDHC2   /*!< Peripheral name */
#define BOARD_INIT_WICED_WIDI_SDIO_D3_SIGNAL                          usdhc_data   /*!< Signal name */
#define BOARD_INIT_WICED_WIDI_SDIO_D3_CHANNEL                                 3U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_Wiced(void);

/* USB_OTG1_DN (coord M8), DM */
/* Routed pin properties */
#define BOARD_INIT_USB_DM_PERIPHERAL                                        USB1   /*!< Peripheral name */
#define BOARD_INIT_USB_DM_SIGNAL                                     usb_otg1_dn   /*!< Signal name */

/* USB_OTG1_DP (coord L8), DP */
/* Routed pin properties */
#define BOARD_INIT_USB_DP_PERIPHERAL                                        USB1   /*!< Peripheral name */
#define BOARD_INIT_USB_DP_SIGNAL                                     usb_otg1_dp   /*!< Signal name */

/* GPIO_AD_B0_01 (coord H10), ID */
/* Routed pin properties */
#define BOARD_INIT_USB_ID_PERIPHERAL                                        USB1   /*!< Peripheral name */
#define BOARD_INIT_USB_ID_SIGNAL                                     usb_otg1_id   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_USB(void);

#define BOARD_INIT_LED_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x0CU /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

