SensorLogicInc/modules/slmx4_projects/lux_demo/board/pin_mux.h
/* GPIO_AD_B0_02 (coord M11), RED */
/* Routed pin properties */
#define BOARD_INIT_LED_RED_PERIPHERAL                                      GPIO6   /*!< Peripheral name */
#define BOARD_INIT_LED_RED_SIGNAL                                        gpio_io   /*!< Signal name */
#define BOARD_INIT_LED_RED_CHANNEL                                            2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_LED_RED_GPIO                                            GPIO6   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_LED_RED_GPIO_PIN                                           2U   /*!< GPIO pin number */
#define BOARD_INIT_LED_RED_GPIO_PIN_MASK                              (1U << 2U)   /*!< GPIO pin mask */
#define BOARD_INIT_LED_RED_PORT                                            GPIO6   /*!< PORT peripheral base pointer */
#define BOARD_INIT_LED_RED_PIN                                                2U   /*!< PORT pin number */
#define BOARD_INIT_LED_RED_PIN_MASK                                   (1U << 2U)   /*!< PORT pin mask */

/* GPIO_AD_B0_03 (coord G11), GREEN */
/* Routed pin properties */
#define BOARD_INIT_LED_GREEN_PERIPHERAL                                    GPIO6   /*!< Peripheral name */
#define BOARD_INIT_LED_GREEN_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INIT_LED_GREEN_CHANNEL                                          3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_LED_GREEN_GPIO                                          GPIO6   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_LED_GREEN_GPIO_PIN                                         3U   /*!< GPIO pin number */
#define BOARD_INIT_LED_GREEN_GPIO_PIN_MASK                            (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_INIT_LED_GREEN_PORT                                          GPIO6   /*!< PORT peripheral base pointer */
#define BOARD_INIT_LED_GREEN_PIN                                              3U   /*!< PORT pin number */
#define BOARD_INIT_LED_GREEN_PIN_MASK                                 (1U << 3U)   /*!< PORT pin mask */

/* GPIO_B0_11 (coord A10), PWMG */
/* Routed pin properties */
#define BOARD_INIT_LED_PWMG_PERIPHERAL                                      PWM2   /*!< Peripheral name */
#define BOARD_INIT_LED_PWMG_SIGNAL                                             B   /*!< Signal name */
#define BOARD_INIT_LED_PWMG_CHANNEL                                           2U   /*!< Signal channel */

/* GPIO_B0_09 (coord C9), PWMB */
/* Routed pin properties */
#define BOARD_INIT_LED_PWMB_PERIPHERAL                                      PWM2   /*!< Peripheral name */
#define BOARD_INIT_LED_PWMB_SIGNAL                                             B   /*!< Signal name */
#define BOARD_INIT_LED_PWMB_CHANNEL                                           1U   /*!< Signal channel */

/* GPIO_B0_07 (coord A9), PWMR */
/* Routed pin properties */
#define BOARD_INIT_LED_PWMR_PERIPHERAL                                      PWM2   /*!< Peripheral name */
#define BOARD_INIT_LED_PWMR_SIGNAL                                             B   /*!< Signal name */
#define BOARD_INIT_LED_PWMR_CHANNEL                                           0U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_LED(void);

/* GPIO_AD_B0_11 (coord G10), TRST */
/* Routed pin properties */
#define BOARD_INIT_JTAG_TRST_PERIPHERAL                                     JTAG   /*!< Peripheral name */
#define BOARD_INIT_JTAG_TRST_SIGNAL                                        TRSTB   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_JTAG(void);

#define BOARD_INIT_X4_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x0F0070U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_B0_01 (coord E7), SPI_MISO */
/* Routed pin properties */
#define BOARD_INIT_X4_SPI_MISO_PERIPHERAL                                 LPSPI4   /*!< Peripheral name */
#define BOARD_INIT_X4_SPI_MISO_SIGNAL                                        SDI   /*!< Signal name */

/* GPIO_B0_03 (coord D8), SPI_SCLK */
/* Routed pin properties */
#define BOARD_INIT_X4_SPI_SCLK_PERIPHERAL                                 LPSPI4   /*!< Peripheral name */
#define BOARD_INIT_X4_SPI_SCLK_SIGNAL                                        SCK   /*!< Signal name */

/* GPIO_B0_00 (coord D7), SPI_CS */
/* Routed pin properties */
#define BOARD_INIT_X4_SPI_CS_PERIPHERAL                                   LPSPI4   /*!< Peripheral name */
#define BOARD_INIT_X4_SPI_CS_SIGNAL                                         PCS0   /*!< Signal name */

/* GPIO_B0_02 (coord E8), SPI_MOSI */
/* Routed pin properties */
#define BOARD_INIT_X4_SPI_MOSI_PERIPHERAL                                 LPSPI4   /*!< Peripheral name */
#define BOARD_INIT_X4_SPI_MOSI_SIGNAL                                        SDO   /*!< Signal name */

/* GPIO_B0_06 (coord A8), EN */
/* Routed pin properties */
#define BOARD_INIT_X4_EN_PERIPHERAL                                        GPIO7   /*!< Peripheral name */
#define BOARD_INIT_X4_EN_SIGNAL                                          gpio_io   /*!< Signal name */
#define BOARD_INIT_X4_EN_CHANNEL                                              6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_X4_EN_GPIO                                              GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_X4_EN_GPIO_PIN                                             6U   /*!< GPIO pin number */
#define BOARD_INIT_X4_EN_GPIO_PIN_MASK                                (1U << 6U)   /*!< GPIO pin mask */
#define BOARD_INIT_X4_EN_PORT                                              GPIO7   /*!< PORT peripheral base pointer */
#define BOARD_INIT_X4_EN_PIN                                                  6U   /*!< PORT pin number */
#define BOARD_INIT_X4_EN_PIN_MASK                                     (1U << 6U)   /*!< PORT pin mask */

/* GPIO_B0_04 (coord C8), GPIO1 */
/* Routed pin properties */
#define BOARD_INIT_X4_GPIO1_PERIPHERAL                                     GPIO2   /*!< Peripheral name */
#define BOARD_INIT_X4_GPIO1_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_INIT_X4_GPIO1_CHANNEL                                           4U   /*!< Signal channel */

