SensorLogicInc/modules/slmx4_projects/lux_demo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INIT_X4_GPIO1_GPIO                                           GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_X4_GPIO1_GPIO_PIN                                          4U   /*!< GPIO pin number */
#define BOARD_INIT_X4_GPIO1_GPIO_PIN_MASK                             (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INIT_X4_GPIO1_PORT                                           GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_X4_GPIO1_PIN                                               4U   /*!< PORT pin number */
#define BOARD_INIT_X4_GPIO1_PIN_MASK                                  (1U << 4U)   /*!< PORT pin mask */

/* GPIO_B0_05 (coord B8), GPIO2 */
/* Routed pin properties */
#define BOARD_INIT_X4_GPIO2_PERIPHERAL                                     GPIO2   /*!< Peripheral name */
#define BOARD_INIT_X4_GPIO2_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_INIT_X4_GPIO2_CHANNEL                                           5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_X4_GPIO2_GPIO                                           GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_X4_GPIO2_GPIO_PIN                                          5U   /*!< GPIO pin number */
#define BOARD_INIT_X4_GPIO2_GPIO_PIN_MASK                             (1U << 5U)   /*!< GPIO pin mask */
#define BOARD_INIT_X4_GPIO2_PORT                                           GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_X4_GPIO2_PIN                                               5U   /*!< PORT pin number */
#define BOARD_INIT_X4_GPIO2_PIN_MASK                                  (1U << 5U)   /*!< PORT pin mask */

/* GPIO_B1_01 (coord B11), GPIO3 */
/* Routed pin properties */
#define BOARD_INIT_X4_GPIO3_PERIPHERAL                                     GPIO2   /*!< Peripheral name */
#define BOARD_INIT_X4_GPIO3_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_INIT_X4_GPIO3_CHANNEL                                          17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_X4_GPIO3_GPIO                                           GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_X4_GPIO3_GPIO_PIN                                         17U   /*!< GPIO pin number */
#define BOARD_INIT_X4_GPIO3_GPIO_PIN_MASK                            (1U << 17U)   /*!< GPIO pin mask */
#define BOARD_INIT_X4_GPIO3_PORT                                           GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_X4_GPIO3_PIN                                              17U   /*!< PORT pin number */
#define BOARD_INIT_X4_GPIO3_PIN_MASK                                 (1U << 17U)   /*!< PORT pin mask */

/* GPIO_B1_00 (coord A11), GPIO4 */
/* Routed pin properties */
#define BOARD_INIT_X4_GPIO4_PERIPHERAL                                     GPIO2   /*!< Peripheral name */
#define BOARD_INIT_X4_GPIO4_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_INIT_X4_GPIO4_CHANNEL                                          16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_X4_GPIO4_GPIO                                           GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_X4_GPIO4_GPIO_PIN                                         16U   /*!< GPIO pin number */
#define BOARD_INIT_X4_GPIO4_GPIO_PIN_MASK                            (1U << 16U)   /*!< GPIO pin mask */
#define BOARD_INIT_X4_GPIO4_PORT                                           GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_X4_GPIO4_PIN                                              16U   /*!< PORT pin number */
#define BOARD_INIT_X4_GPIO4_PIN_MASK                                 (1U << 16U)   /*!< PORT pin mask */

/* GPIO_B1_02 (coord C11), SPI_CS2 */
/* Routed pin properties */
#define BOARD_INIT_X4_SPI_CS2_PERIPHERAL                                   GPIO2   /*!< Peripheral name */
#define BOARD_INIT_X4_SPI_CS2_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INIT_X4_SPI_CS2_CHANNEL                                        18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_X4_SPI_CS2_GPIO                                         GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_X4_SPI_CS2_GPIO_PIN                                       18U   /*!< GPIO pin number */
#define BOARD_INIT_X4_SPI_CS2_GPIO_PIN_MASK                          (1U << 18U)   /*!< GPIO pin mask */
#define BOARD_INIT_X4_SPI_CS2_PORT                                         GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_X4_SPI_CS2_PIN                                            18U   /*!< PORT pin number */
#define BOARD_INIT_X4_SPI_CS2_PIN_MASK                               (1U << 18U)   /*!< PORT pin mask */

/* GPIO_B1_03 (coord D11), SPI_CS1 */
/* Routed pin properties */
#define BOARD_INIT_X4_SPI_CS1_PERIPHERAL                                   GPIO2   /*!< Peripheral name */
#define BOARD_INIT_X4_SPI_CS1_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INIT_X4_SPI_CS1_CHANNEL                                        19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_X4_SPI_CS1_GPIO                                         GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INIT_X4_SPI_CS1_GPIO_PIN                                       19U   /*!< GPIO pin number */
#define BOARD_INIT_X4_SPI_CS1_GPIO_PIN_MASK                          (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INIT_X4_SPI_CS1_PORT                                         GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INIT_X4_SPI_CS1_PIN                                            19U   /*!< PORT pin number */
#define BOARD_INIT_X4_SPI_CS1_PIN_MASK                               (1U << 19U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_X4(void);

/* GPIO_AD_B1_00 (coord J11), SCL */
/* Routed pin properties */
#define BOARD_INIT_I2C_SCL_PERIPHERAL                                     LPI2C1   /*!< Peripheral name */
#define BOARD_INIT_I2C_SCL_SIGNAL                                            SCL   /*!< Signal name */

/* GPIO_AD_B1_01 (coord K11), SDA */
/* Routed pin properties */
#define BOARD_INIT_I2C_SDA_PERIPHERAL                                     LPI2C1   /*!< Peripheral name */
#define BOARD_INIT_I2C_SDA_SIGNAL                                            SDA   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_I2C(void);

/* GPIO_AD_B1_02 (coord L11), UART2_TX */
/* Routed pin properties */
#define BOARD_INIT_UART_UART2_TX_PERIPHERAL                              LPUART2   /*!< Peripheral name */
#define BOARD_INIT_UART_UART2_TX_SIGNAL                                       TX   /*!< Signal name */

/* GPIO_AD_B1_03 (coord M12), UART2_RX */
/* Routed pin properties */
#define BOARD_INIT_UART_UART2_RX_PERIPHERAL                              LPUART2   /*!< Peripheral name */
#define BOARD_INIT_UART_UART2_RX_SIGNAL                                       RX   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_UART(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
